Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
8:28:57.608 STDOUT [env/dev/vpc] terraform1.14.3:       + enable_dns_hostnames                 = true
08:28:57.608 STDOUT [env/dev/vpc] terraform1.14.3:       + enable_dns_support                   = true
08:28:57.608 STDOUT [env/dev/vpc] terraform1.14.3:       + enable_network_address_usage_metrics = (known after apply)
08:28:57.608 STDOUT [env/dev/vpc] terraform1.14.3:       + id                                   = (known after apply)
08:28:57.608 STDOUT [env/dev/vpc] terraform1.14.3:       + instance_tenancy                     = "default"
08:28:57.608 STDOUT [env/dev/vpc] terraform1.14.3:       + ipv6_association_id                  = (known after apply)
08:28:57.609 STDOUT [env/dev/vpc] terraform1.14.3:       + ipv6_cidr_block                      = (known after apply)
08:28:57.609 STDOUT [env/dev/vpc] terraform1.14.3:       + ipv6_cidr_block_network_border_group = (known after apply)
08:28:57.609 STDOUT [env/dev/vpc] terraform1.14.3:       + main_route_table_id                  = (known after apply)
08:28:57.609 STDOUT [env/dev/vpc] terraform1.14.3:       + owner_id                             = (known after apply)
08:28:57.609 STDOUT [env/dev/vpc] terraform1.14.3:       + region                               = "us-east-1"
08:28:57.609 STDOUT [env/dev/vpc] terraform1.14.3:       + tags                                 = {
08:28:57.609 STDOUT [env/dev/vpc] terraform1.14.3:           + "Name" = "dev-vpc"
08:28:57.609 STDOUT [env/dev/vpc] terraform1.14.3:           + "env"  = "dev"
08:28:57.609 STDOUT [env/dev/vpc] terraform1.14.3:         }
08:28:57.609 STDOUT [env/dev/vpc] terraform1.14.3:       + tags_all                             = {
08:28:57.610 STDOUT [env/dev/vpc] terraform1.14.3:           + "Name" = "dev-vpc"
08:28:57.610 STDOUT [env/dev/vpc] terraform1.14.3:           + "env"  = "dev"
08:28:57.610 STDOUT [env/dev/vpc] terraform1.14.3:         }
08:28:57.610 STDOUT [env/dev/vpc] terraform1.14.3:     }
08:28:57.610 STDOUT [env/dev/vpc] terraform1.14.3: Plan: 18 to add, 0 to change, 0 to destroy.
08:28:57.610 STDOUT [env/dev/vpc] terraform1.14.3: Changes to Outputs:
08:28:57.610 STDOUT [env/dev/vpc] terraform1.14.3:   + aws_vpc_id         = (known after apply)
08:28:57.610 STDOUT [env/dev/vpc] terraform1.14.3:   + private_subnet_ids = [
08:28:57.610 STDOUT [env/dev/vpc] terraform1.14.3:       + (known after apply),
08:28:57.610 STDOUT [env/dev/vpc] terraform1.14.3:       + (known after apply),
08:28:57.611 STDOUT [env/dev/vpc] terraform1.14.3:       + (known after apply),
08:28:57.611 STDOUT [env/dev/vpc] terraform1.14.3:     ]
08:28:57.611 STDOUT [env/dev/vpc] terraform1.14.3:   + public_subnet_ids  = [
08:28:57.611 STDOUT [env/dev/vpc] terraform1.14.3:       + (known after apply),
08:28:57.612 STDOUT [env/dev/vpc] terraform1.14.3:       + (known after apply),
08:28:57.612 STDOUT [env/dev/vpc] terraform1.14.3:       + (known after apply),
08:28:57.612 STDOUT [env/dev/vpc] terraform1.14.3:     ]
08:28:58.204 STDOUT [env/dev/vpc] terraform1.14.3: aws_eip.nat[0]: Creating...
08:28:58.204 STDOUT [env/dev/vpc] terraform1.14.3: aws_vpc.main: Creating...
08:29:00.112 STDOUT [env/dev/vpc] terraform1.14.3: aws_vpc.main: Creation complete after 2s [id=vpc-0d00152ece6e94c77]
08:29:00.125 STDOUT [env/dev/vpc] terraform1.14.3: aws_internet_gateway.igw: Creating...
08:29:00.131 STDOUT [env/dev/vpc] terraform1.14.3: aws_subnet.private_subnet[2]: Creating...
08:29:00.131 STDOUT [env/dev/vpc] terraform1.14.3: aws_subnet.public_subnet[0]: Creating...
08:29:00.131 STDOUT [env/dev/vpc] terraform1.14.3: aws_subnet.private_subnet[0]: Creating...
08:29:00.133 STDOUT [env/dev/vpc] terraform1.14.3: aws_subnet.public_subnet[2]: Creating...
08:29:00.142 STDOUT [env/dev/vpc] terraform1.14.3: aws_subnet.private_subnet[1]: Creating...
08:29:00.142 STDOUT [env/dev/vpc] terraform1.14.3: aws_subnet.public_subnet[1]: Creating...
08:29:00.154 STDOUT [env/dev/vpc] terraform1.14.3: aws_eip.nat[0]: Creation complete after 2s [id=eipalloc-049e854e91ce727d4]
08:29:00.620 STDOUT [env/dev/vpc] terraform1.14.3: aws_internet_gateway.igw: Creation complete after 1s [id=igw-04267c3d781f67ea4]
08:29:00.625 STDOUT [env/dev/vpc] terraform1.14.3: aws_route_table.public_rtb: Creating...
08:29:00.761 STDOUT [env/dev/vpc] terraform1.14.3: aws_subnet.public_subnet[0]: Creation complete after 1s [id=subnet-00cb13446e3475fb0]
08:29:00.764 STDOUT [env/dev/vpc] terraform1.14.3: aws_subnet.private_subnet[2]: Creation complete after 1s [id=subnet-07841a8f6b8c6335b]
08:29:00.767 STDOUT [env/dev/vpc] terraform1.14.3: aws_nat_gateway.ngw[0]: Creating...
08:29:01.551 STDOUT [env/dev/vpc] terraform1.14.3: aws_route_table.public_rtb: Creation complete after 1s [id=rtb-02a28d9a8ec415fe0]
08:29:03.044 STDOUT [env/dev/vpc] terraform1.14.3: aws_subnet.public_subnet[2]: Creation complete after 3s [id=subnet-0a08c3b5e16bf69f1]
08:29:03.992 STDOUT [env/dev/vpc] terraform1.14.3: aws_subnet.private_subnet[0]: Creation complete after 4s [id=subnet-05d10582d81d7a1ea]
08:29:04.243 STDOUT [env/dev/vpc] terraform1.14.3: aws_subnet.public_subnet[1]: Creation complete after 4s [id=subnet-00210e0a2ca500c22]
08:29:04.249 STDOUT [env/dev/vpc] terraform1.14.3: aws_route_table_association.public_rtb_association[0]: Creating...
08:29:04.250 STDOUT [env/dev/vpc] terraform1.14.3: aws_route_table_association.public_rtb_association[1]: Creating...
08:29:04.255 STDOUT [env/dev/vpc] terraform1.14.3: aws_route_table_association.public_rtb_association[2]: Creating...
08:29:04.362 STDOUT [env/dev/vpc] terraform1.14.3: aws_subnet.private_subnet[1]: Creation complete after 4s [id=subnet-0020652c3d4869215]
08:29:04.608 STDOUT [env/dev/vpc] terraform1.14.3: aws_route_table_association.public_rtb_association[1]: Creation complete after 1s [id=rtbassoc-0452f2a9d77107bcc]
08:29:04.635 STDOUT [env/dev/vpc] terraform1.14.3: aws_route_table_association.public_rtb_association[0]: Creation complete after 1s [id=rtbassoc-0f571dc5cc8efd472]
08:29:04.668 STDOUT [env/dev/vpc] terraform1.14.3: aws_route_table_association.public_rtb_association[2]: Creation complete after 1s [id=rtbassoc-0b4ffb922008a468f]
08:29:10.768 STDOUT [env/dev/vpc] terraform1.14.3: aws_nat_gateway.ngw[0]: Still creating... [00m10s elapsed]
08:29:20.768 STDOUT [env/dev/vpc] terraform1.14.3: aws_nat_gateway.ngw[0]: Still creating... [00m20s elapsed]
08:29:30.768 STDOUT [env/dev/vpc] terraform1.14.3: aws_nat_gateway.ngw[0]: Still creating... [00m30s elapsed]
08:29:40.768 STDOUT [env/dev/vpc] terraform1.14.3: aws_nat_gateway.ngw[0]: Still creating... [00m40s elapsed]
08:29:50.768 STDOUT [env/dev/vpc] terraform1.14.3: aws_nat_gateway.ngw[0]: Still creating... [00m50s elapsed]
08:30:00.769 STDOUT [env/dev/vpc] terraform1.14.3: aws_nat_gateway.ngw[0]: Still creating... [01m00s elapsed]
08:30:10.769 STDOUT [env/dev/vpc] terraform1.14.3: aws_nat_gateway.ngw[0]: Still creating... [01m10s elapsed]
08:30:20.769 STDOUT [env/dev/vpc] terraform1.14.3: aws_nat_gateway.ngw[0]: Still creating... [01m20s elapsed]
08:30:30.769 STDOUT [env/dev/vpc] terraform1.14.3: aws_nat_gateway.ngw[0]: Still creating... [01m30s elapsed]
08:30:40.769 STDOUT [env/dev/vpc] terraform1.14.3: aws_nat_gateway.ngw[0]: Still creating... [01m40s elapsed]
08:30:50.770 STDOUT [env/dev/vpc] terraform1.14.3: aws_nat_gateway.ngw[0]: Still creating... [01m50s elapsed]
08:31:00.770 STDOUT [env/dev/vpc] terraform1.14.3: aws_nat_gateway.ngw[0]: Still creating... [02m00s elapsed]
08:31:04.613 STDOUT [env/dev/vpc] terraform1.14.3: aws_nat_gateway.ngw[0]: Creation complete after 2m4s [id=nat-02435919ef8e48a60]
08:31:04.713 STDOUT [env/dev/vpc] terraform1.14.3: aws_route_table.private_rtb[0]: Creating...
08:31:14.714 STDOUT [env/dev/vpc] terraform1.14.3: aws_route_table.private_rtb[0]: Still creating... [00m10s elapsed]
08:31:24.715 STDOUT [env/dev/vpc] terraform1.14.3: aws_route_table.private_rtb[0]: Still creating... [00m20s elapsed]
08:31:24.972 STDOUT [env/dev/vpc] terraform1.14.3: aws_route_table.private_rtb[0]: Creation complete after 20s [id=rtb-0f34396840505ea8e]
08:31:25.034 STDOUT [env/dev/vpc] terraform1.14.3: aws_route_table_association.private_rtb_association[0]: Creating...
08:31:25.034 STDOUT [env/dev/vpc] terraform1.14.3: aws_route_table_association.private_rtb_association[1]: Creating...
08:31:25.034 STDOUT [env/dev/vpc] terraform1.14.3: aws_route_table_association.private_rtb_association[2]: Creating...
08:31:25.360 STDOUT [env/dev/vpc] terraform1.14.3: aws_route_table_association.private_rtb_association[0]: Creation complete after 0s [id=rtbassoc-0fa2706a546a473f0]
08:31:25.367 STDOUT [env/dev/vpc] terraform1.14.3: aws_route_table_association.private_rtb_association[1]: Creation complete after 0s [id=rtbassoc-059a6173306ce0322]
08:31:25.391 STDOUT [env/dev/vpc] terraform1.14.3: aws_route_table_association.private_rtb_association[2]: Creation complete after 0s [id=rtbassoc-0d9d3ee70ba23d7b4]
08:31:25.437 STDOUT [env/dev/vpc] terraform1.14.3: Apply complete! Resources: 18 added, 0 changed, 0 destroyed.
08:31:25.437 STDOUT [env/dev/vpc] terraform1.14.3: Outputs:
08:31:25.437 STDOUT [env/dev/vpc] terraform1.14.3: aws_vpc_id = "vpc-0d00152ece6e94c77"
08:31:25.437 STDOUT [env/dev/vpc] terraform1.14.3: private_subnet_ids = [
08:31:25.437 STDOUT [env/dev/vpc] terraform1.14.3:   "subnet-05d10582d81d7a1ea",
08:31:25.437 STDOUT [env/dev/vpc] terraform1.14.3:   "subnet-0020652c3d4869215",
08:31:25.437 STDOUT [env/dev/vpc] terraform1.14.3:   "subnet-07841a8f6b8c6335b",
08:31:25.438 STDOUT [env/dev/vpc] terraform1.14.3: ]
08:31:25.438 STDOUT [env/dev/vpc] terraform1.14.3: public_subnet_ids = [
08:31:25.438 STDOUT [env/dev/vpc] terraform1.14.3:   "subnet-00cb13446e3475fb0",
08:31:25.438 STDOUT [env/dev/vpc] terraform1.14.3:   "subnet-00210e0a2ca500c22",
08:31:25.438 STDOUT [env/dev/vpc] terraform1.14.3:   "subnet-0a08c3b5e16bf69f1",
08:31:25.438 STDOUT [env/dev/vpc] terraform1.14.3: ]
08:31:28.147 INFO   [env/dev/load-balancer] Downloading Terraform configurations from ./modules/load-balancer into ./env/dev/load-balancer/.terragrunt-cache/HcBOMLKY6n0VQx9bcXfoSNRAa8Y/3gWGmK8aJpzrdhJhHr7pAJvx1rE
08:31:28.176 INFO   [env/dev/load-balancer] terraform1.14.3: Initializing the backend...
08:31:28.274 INFO   [env/dev/load-balancer] terraform1.14.3: Successfully configured the backend "s3"! Terraform will automatically
08:31:28.274 INFO   [env/dev/load-balancer] terraform1.14.3: use this backend unless the backend configuration changes.
08:31:28.327 INFO   [env/dev/load-balancer] terraform1.14.3: Initializing provider plugins...
08:31:28.327 INFO   [env/dev/load-balancer] terraform1.14.3: - Reusing previous version of hashicorp/aws from the dependency lock file
08:31:28.404 INFO   [env/dev/load-balancer] terraform1.14.3: - Installing hashicorp/aws v6.36.0...
08:31:42.771 INFO   [env/dev/load-balancer] terraform1.14.3: - Installed hashicorp/aws v6.36.0 (signed by HashiCorp)
08:31:42.771 INFO   [env/dev/load-balancer] terraform1.14.3: Terraform has made some changes to the provider dependency selections recorded
08:31:42.771 INFO   [env/dev/load-balancer] terraform1.14.3: in the .terraform.lock.hcl file. Review those changes and commit them to your
08:31:42.771 INFO   [env/dev/load-balancer] terraform1.14.3: version control system if they represent changes you intended to make.
08:31:42.771 INFO   [env/dev/load-balancer] terraform1.14.3: Terraform has been successfully initialized!
08:31:48.921 STDOUT [env/dev/load-balancer] terraform1.14.3: Terraform used the selected providers to generate the following execution
08:31:48.921 STDOUT [env/dev/load-balancer] terraform1.14.3: plan. Resource actions are indicated with the following symbols:
08:31:48.921 STDOUT [env/dev/load-balancer] terraform1.14.3:   + create
08:31:48.921 STDOUT [env/dev/load-balancer] terraform1.14.3: Terraform will perform the following actions:
08:31:48.921 STDOUT [env/dev/load-balancer] terraform1.14.3:   # aws_lb.lb will be created
08:31:48.921 STDOUT [env/dev/load-balancer] terraform1.14.3:   + resource "aws_lb" "lb" {
08:31:48.921 STDOUT [env/dev/load-balancer] terraform1.14.3:       + arn                                                          = (known after apply)
08:31:48.921 STDOUT [env/dev/load-balancer] terraform1.14.3:       + arn_suffix                                                   = (known after apply)
08:31:48.921 STDOUT [env/dev/load-balancer] terraform1.14.3:       + client_keep_alive                                            = 3600
08:31:48.922 STDOUT [env/dev/load-balancer] terraform1.14.3:       + desync_mitigation_mode                                       = "defensive"
08:31:48.922 STDOUT [env/dev/load-balancer] terraform1.14.3:       + dns_name                                                     = (known after apply)
08:31:48.922 STDOUT [env/dev/load-balancer] terraform1.14.3:       + drop_invalid_header_fields                                   = false
08:31:48.922 STDOUT [env/dev/load-balancer] terraform1.14.3:       + enable_deletion_protection                                   = false
08:31:48.922 STDOUT [env/dev/load-balancer] terraform1.14.3:       + enable_http2                                                 = true
08:31:48.922 STDOUT [env/dev/load-balancer] terraform1.14.3:       + enable_tls_version_and_cipher_suite_headers                  = false
08:31:48.922 STDOUT [env/dev/load-balancer] terraform1.14.3:       + enable_waf_fail_open                                         = false
08:31:48.922 STDOUT [env/dev/load-balancer] terraform1.14.3:       + enable_xff_client_port                                       = false
08:31:48.922 STDOUT [env/dev/load-balancer] terraform1.14.3:       + enable_zonal_shift                                           = false
08:31:48.923 STDOUT [env/dev/load-balancer] terraform1.14.3:       + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
08:31:48.923 STDOUT [env/dev/load-balancer] terraform1.14.3:       + id                                                           = (known after apply)
08:31:48.923 STDOUT [env/dev/load-balancer] terraform1.14.3:       + idle_timeout                                                 = 60
08:31:48.923 STDOUT [env/dev/load-balancer] terraform1.14.3:       + internal                                                     = false
08:31:48.923 STDOUT [env/dev/load-balancer] terraform1.14.3:       + ip_address_type                                              = (known after apply)
08:31:48.923 STDOUT [env/dev/load-balancer] terraform1.14.3:       + load_balancer_type                                           = "application"
08:31:48.923 STDOUT [env/dev/load-balancer] terraform1.14.3:       + name                                                         = "dev-alb"
08:31:48.923 STDOUT [env/dev/load-balancer] terraform1.14.3:       + name_prefix                                                  = (known after apply)
08:31:48.923 STDOUT [env/dev/load-balancer] terraform1.14.3:       + preserve_host_header                                         = false
08:31:48.924 STDOUT [env/dev/load-balancer] terraform1.14.3:       + region                                                       = "us-east-1"
08:31:48.924 STDOUT [env/dev/load-balancer] terraform1.14.3:       + secondary_ips_auto_assigned_per_subnet                       = (known after apply)
08:31:48.924 STDOUT [env/dev/load-balancer] terraform1.14.3:       + security_groups                                              = (known after apply)
08:31:48.924 STDOUT [env/dev/load-balancer] terraform1.14.3:       + subnets                                                      = [
08:31:48.924 STDOUT [env/dev/load-balancer] terraform1.14.3:           + "subnet-00210e0a2ca500c22",
08:31:48.924 STDOUT [env/dev/load-balancer] terraform1.14.3:           + "subnet-00cb13446e3475fb0",
08:31:48.924 STDOUT [env/dev/load-balancer] terraform1.14.3:           + "subnet-0a08c3b5e16bf69f1",
08:31:48.924 STDOUT [env/dev/load-balancer] terraform1.14.3:         ]
08:31:48.924 STDOUT [env/dev/load-balancer] terraform1.14.3:       + tags                                                         = {
08:31:48.925 STDOUT [env/dev/load-balancer] terraform1.14.3:           + "env" = "dev"
08:31:48.925 STDOUT [env/dev/load-balancer] terraform1.14.3:         }
08:31:48.925 STDOUT [env/dev/load-balancer] terraform1.14.3:       + tags_all                                                     = {
08:31:48.925 STDOUT [env/dev/load-balancer] terraform1.14.3:           + "env" = "dev"
08:31:48.925 STDOUT [env/dev/load-balancer] terraform1.14.3:         }
08:31:48.926 STDOUT [env/dev/load-balancer] terraform1.14.3:       + vpc_id                                                       = (known after apply)
08:31:48.926 STDOUT [env/dev/load-balancer] terraform1.14.3:       + xff_header_processing_mode                                   = "append"
08:31:48.926 STDOUT [env/dev/load-balancer] terraform1.14.3:       + zone_id                                                      = (known after apply)
08:31:48.926 STDOUT [env/dev/load-balancer] terraform1.14.3:       + subnet_mapping (known after apply)
08:31:48.926 STDOUT [env/dev/load-balancer] terraform1.14.3:     }
08:31:48.926 STDOUT [env/dev/load-balancer] terraform1.14.3:   # aws_lb_listener.lb_listener will be created
08:31:48.927 STDOUT [env/dev/load-balancer] terraform1.14.3:   + resource "aws_lb_listener" "lb_listener" {
08:31:48.927 STDOUT [env/dev/load-balancer] terraform1.14.3:       + arn                                                                   = (known after apply)
08:31:48.927 STDOUT [env/dev/load-balancer] terraform1.14.3:       + id                                                                    = (known after apply)
08:31:48.927 STDOUT [env/dev/load-balancer] terraform1.14.3:       + load_balancer_arn                                                     = (known after apply)
08:31:48.927 STDOUT [env/dev/load-balancer] terraform1.14.3:       + port                                                                  = 80
08:31:48.928 STDOUT [env/dev/load-balancer] terraform1.14.3:       + protocol                                                              = "HTTP"
08:31:48.928 STDOUT [env/dev/load-balancer] terraform1.14.3:       + region                                                                = "us-east-1"
08:31:48.928 STDOUT [env/dev/load-balancer] terraform1.14.3:       + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
08:31:48.928 STDOUT [env/dev/load-balancer] terraform1.14.3:       + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
08:31:48.928 STDOUT [env/dev/load-balancer] terraform1.14.3:       + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
08:31:48.929 STDOUT [env/dev/load-balancer] terraform1.14.3:       + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
08:31:48.929 STDOUT [env/dev/load-balancer] terraform1.14.3:       + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
08:31:48.929 STDOUT [env/dev/load-balancer] terraform1.14.3:       + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
08:31:48.929 STDOUT [env/dev/load-balancer] terraform1.14.3:       + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
08:31:48.929 STDOUT [env/dev/load-balancer] terraform1.14.3:       + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
08:31:48.930 STDOUT [env/dev/load-balancer] terraform1.14.3:       + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
08:31:48.930 STDOUT [env/dev/load-balancer] terraform1.14.3:       + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
08:31:48.930 STDOUT [env/dev/load-balancer] terraform1.14.3:       + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
08:31:48.930 STDOUT [env/dev/load-balancer] terraform1.14.3:       + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
08:31:48.930 STDOUT [env/dev/load-balancer] terraform1.14.3:       + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
08:31:48.931 STDOUT [env/dev/load-balancer] terraform1.14.3:       + routing_http_response_access_control_max_age_header_value             = (known after apply)
08:31:48.931 STDOUT [env/dev/load-balancer] terraform1.14.3:       + routing_http_response_content_security_policy_header_value            = (known after apply)
08:31:48.931 STDOUT [env/dev/load-balancer] terraform1.14.3:       + routing_http_response_server_enabled                                  = (known after apply)
08:31:48.931 STDOUT [env/dev/load-balancer] terraform1.14.3:       + routing_http_response_strict_transport_security_header_value          = (known after apply)
08:31:48.931 STDOUT [env/dev/load-balancer] terraform1.14.3:       + routing_http_response_x_content_type_options_header_value             = (known after apply)
08:31:48.932 STDOUT [env/dev/load-balancer] terraform1.14.3:       + routing_http_response_x_frame_options_header_value                    = (known after apply)
08:31:48.932 STDOUT [env/dev/load-balancer] terraform1.14.3:       + ssl_policy                                                            = (known after apply)
08:31:48.932 STDOUT [env/dev/load-balancer] terraform1.14.3:       + tags_all                                                              = (known after apply)
08:31:48.932 STDOUT [env/dev/load-balancer] terraform1.14.3:       + tcp_idle_timeout_seconds                                              = (known after apply)
08:31:48.932 STDOUT [env/dev/load-balancer] terraform1.14.3:       + default_action {
08:31:48.932 STDOUT [env/dev/load-balancer] terraform1.14.3:           + order = (known after apply)
08:31:48.932 STDOUT [env/dev/load-balancer] terraform1.14.3:           + type  = "forward"
08:31:48.933 STDOUT [env/dev/load-balancer] terraform1.14.3:           + forward {
08:31:48.933 STDOUT [env/dev/load-balancer] terraform1.14.3:               + target_group {
08:31:48.933 STDOUT [env/dev/load-balancer] terraform1.14.3:                   + arn    = (known after apply)
08:31:48.933 STDOUT [env/dev/load-balancer] terraform1.14.3:                   + weight = 100
08:31:48.933 STDOUT [env/dev/load-balancer] terraform1.14.3:                 }
08:31:48.933 STDOUT [env/dev/load-balancer] terraform1.14.3:             }
08:31:48.933 STDOUT [env/dev/load-balancer] terraform1.14.3:         }
08:31:48.933 STDOUT [env/dev/load-balancer] terraform1.14.3:       + mutual_authentication (known after apply)
08:31:48.933 STDOUT [env/dev/load-balancer] terraform1.14.3:     }
08:31:48.933 STDOUT [env/dev/load-balancer] terraform1.14.3:   # aws_lb_target_group.tg will be created
08:31:48.933 STDOUT [env/dev/load-balancer] terraform1.14.3:   + resource "aws_lb_target_group" "tg" {
08:31:48.934 STDOUT [env/dev/load-balancer] terraform1.14.3:       + arn                                = (known after apply)
08:31:48.934 STDOUT [env/dev/load-balancer] terraform1.14.3:       + arn_suffix                         = (known after apply)
08:31:48.934 STDOUT [env/dev/load-balancer] terraform1.14.3:       + connection_termination             = (known after apply)
08:31:48.934 STDOUT [env/dev/load-balancer] terraform1.14.3:       + deregistration_delay               = "300"
08:31:48.934 STDOUT [env/dev/load-balancer] terraform1.14.3:       + id                                 = (known after apply)
08:31:48.934 STDOUT [env/dev/load-balancer] terraform1.14.3:       + ip_address_type                    = (known after apply)
08:31:48.934 STDOUT [env/dev/load-balancer] terraform1.14.3:       + lambda_multi_value_headers_enabled = false
08:31:48.934 STDOUT [env/dev/load-balancer] terraform1.14.3:       + load_balancer_arns                 = (known after apply)
08:31:48.935 STDOUT [env/dev/load-balancer] terraform1.14.3:       + load_balancing_algorithm_type      = (known after apply)
08:31:48.935 STDOUT [env/dev/load-balancer] terraform1.14.3:       + load_balancing_anomaly_mitigation  = (known after apply)
08:31:48.935 STDOUT [env/dev/load-balancer] terraform1.14.3:       + load_balancing_cross_zone_enabled  = (known after apply)
08:31:48.935 STDOUT [env/dev/load-balancer] terraform1.14.3:       + name                               = "dev-tg"
08:31:48.935 STDOUT [env/dev/load-balancer] terraform1.14.3:       + name_prefix                        = (known after apply)
08:31:48.935 STDOUT [env/dev/load-balancer] terraform1.14.3:       + port                               = 80
08:31:48.936 STDOUT [env/dev/load-balancer] terraform1.14.3:       + preserve_client_ip                 = (known after apply)
08:31:48.936 STDOUT [env/dev/load-balancer] terraform1.14.3:       + protocol                           = "HTTP"
08:31:48.936 STDOUT [env/dev/load-balancer] terraform1.14.3:       + protocol_version                   = (known after apply)
08:31:48.936 STDOUT [env/dev/load-balancer] terraform1.14.3:       + proxy_protocol_v2                  = false
08:31:48.936 STDOUT [env/dev/load-balancer] terraform1.14.3:       + region                             = "us-east-1"
08:31:48.936 STDOUT [env/dev/load-balancer] terraform1.14.3:       + slow_start                         = 0
08:31:48.936 STDOUT [env/dev/load-balancer] terraform1.14.3:       + tags_all                           = (known after apply)
08:31:48.936 STDOUT [env/dev/load-balancer] terraform1.14.3:       + target_type                        = "instance"
08:31:48.937 STDOUT [env/dev/load-balancer] terraform1.14.3:       + vpc_id                             = "vpc-0d00152ece6e94c77"
08:31:48.937 STDOUT [env/dev/load-balancer] terraform1.14.3:       + health_check {
08:31:48.937 STDOUT [env/dev/load-balancer] terraform1.14.3:           + enabled             = true
08:31:48.937 STDOUT [env/dev/load-balancer] terraform1.14.3:           + healthy_threshold   = 2
08:31:48.937 STDOUT [env/dev/load-balancer] terraform1.14.3:           + interval            = 30
08:31:48.937 STDOUT [env/dev/load-balancer] terraform1.14.3:           + matcher             = (known after apply)
08:31:48.937 STDOUT [env/dev/load-balancer] terraform1.14.3:           + path                = "/"
08:31:48.937 STDOUT [env/dev/load-balancer] terraform1.14.3:           + port                = "traffic-port"
08:31:48.937 STDOUT [env/dev/load-balancer] terraform1.14.3:           + protocol            = "HTTP"
08:31:48.938 STDOUT [env/dev/load-balancer] terraform1.14.3:           + timeout             = 5
08:31:48.938 STDOUT [env/dev/load-balancer] terraform1.14.3:           + unhealthy_threshold = 3
08:31:48.938 STDOUT [env/dev/load-balancer] terraform1.14.3:         }
08:31:48.938 STDOUT [env/dev/load-balancer] terraform1.14.3:       + stickiness (known after apply)
08:31:48.938 STDOUT [env/dev/load-balancer] terraform1.14.3:       + target_failover (known after apply)
08:31:48.938 STDOUT [env/dev/load-balancer] terraform1.14.3:       + target_group_health (known after apply)
08:31:48.938 STDOUT [env/dev/load-balancer] terraform1.14.3:       + target_health_state (known after apply)
08:31:48.938 STDOUT [env/dev/load-balancer] terraform1.14.3:     }
08:31:48.938 STDOUT [env/dev/load-balancer] terraform1.14.3:   # aws_security_group.alb_sg will be created
08:31:48.938 STDOUT [env/dev/load-balancer] terraform1.14.3:   + resource "aws_security_group" "alb_sg" {
08:31:48.938 STDOUT [env/dev/load-balancer] terraform1.14.3:       + arn                    = (known after apply)
08:31:48.939 STDOUT [env/dev/load-balancer] terraform1.14.3:       + description            = "dev-ALB-security-group"
08:31:48.939 STDOUT [env/dev/load-balancer] terraform1.14.3:       + egress                 = (known after apply)
08:31:48.939 STDOUT [env/dev/load-balancer] terraform1.14.3:       + id                     = (known after apply)
08:31:48.939 STDOUT [env/dev/load-balancer] terraform1.14.3:       + ingress                = (known after apply)
08:31:48.939 STDOUT [env/dev/load-balancer] terraform1.14.3:       + name                   = "dev-alb-sg"
08:31:48.939 STDOUT [env/dev/load-balancer] terraform1.14.3:       + name_prefix            = (known after apply)
08:31:48.939 STDOUT [env/dev/load-balancer] terraform1.14.3:       + owner_id               = (known after apply)
08:31:48.939 STDOUT [env/dev/load-balancer] terraform1.14.3:       + region                 = "us-east-1"
08:31:48.939 STDOUT [env/dev/load-balancer] terraform1.14.3:       + revoke_rules_on_delete = false
08:31:48.939 STDOUT [env/dev/load-balancer] terraform1.14.3:       + tags                   = {
08:31:48.940 STDOUT [env/dev/load-balancer] terraform1.14.3:           + "env" = "dev"
08:31:48.940 STDOUT [env/dev/load-balancer] terraform1.14.3:         }
08:31:48.940 STDOUT [env/dev/load-balancer] terraform1.14.3:       + tags_all               = {
08:31:48.940 STDOUT [env/dev/load-balancer] terraform1.14.3:           + "env" = "dev"
08:31:48.940 STDOUT [env/dev/load-balancer] terraform1.14.3:         }
08:31:48.940 STDOUT [env/dev/load-balancer] terraform1.14.3:       + vpc_id                 = "vpc-0d00152ece6e94c77"
08:31:48.940 STDOUT [env/dev/load-balancer] terraform1.14.3:     }
08:31:48.940 STDOUT [env/dev/load-balancer] terraform1.14.3:   # aws_vpc_security_group_egress_rule.alb_all_out will be created
08:31:48.940 STDOUT [env/dev/load-balancer] terraform1.14.3:   + resource "aws_vpc_security_group_egress_rule" "alb_all_out" {
08:31:48.940 STDOUT [env/dev/load-balancer] terraform1.14.3:       + arn                    = (known after apply)
08:31:48.941 STDOUT [env/dev/load-balancer] terraform1.14.3:       + cidr_ipv4              = "0.0.0.0/0"
08:31:48.941 STDOUT [env/dev/load-balancer] terraform1.14.3:       + id                     = (known after apply)
08:31:48.941 STDOUT [env/dev/load-balancer] terraform1.14.3:       + ip_protocol            = "-1"
08:31:48.941 STDOUT [env/dev/load-balancer] terraform1.14.3:       + region                 = "us-east-1"
08:31:48.941 STDOUT [env/dev/load-balancer] terraform1.14.3:       + security_group_id      = (known after apply)
08:31:48.941 STDOUT [env/dev/load-balancer] terraform1.14.3:       + security_group_rule_id = (known after apply)
08:31:48.941 STDOUT [env/dev/load-balancer] terraform1.14.3:       + tags_all               = {}
08:31:48.941 STDOUT [env/dev/load-balancer] terraform1.14.3:     }
08:31:48.941 STDOUT [env/dev/load-balancer] terraform1.14.3:   # aws_vpc_security_group_ingress_rule.alb_http will be created
08:31:48.942 STDOUT [env/dev/load-balancer] terraform1.14.3:   + resource "aws_vpc_security_group_ingress_rule" "alb_http" {
08:31:48.942 STDOUT [env/dev/load-balancer] terraform1.14.3:       + arn                    = (known after apply)
08:31:48.942 STDOUT [env/dev/load-balancer] terraform1.14.3:       + cidr_ipv4              = "0.0.0.0/0"
08:31:48.942 STDOUT [env/dev/load-balancer] terraform1.14.3:       + from_port              = 80
08:31:48.942 STDOUT [env/dev/load-balancer] terraform1.14.3:       + id                     = (known after apply)
08:31:48.942 STDOUT [env/dev/load-balancer] terraform1.14.3:       + ip_protocol            = "tcp"
08:31:48.942 STDOUT [env/dev/load-balancer] terraform1.14.3:       + region                 = "us-east-1"
08:31:48.942 STDOUT [env/dev/load-balancer] terraform1.14.3:       + security_group_id      = (known after apply)
08:31:48.942 STDOUT [env/dev/load-balancer] terraform1.14.3:       + security_group_rule_id = (known after apply)
08:31:48.942 STDOUT [env/dev/load-balancer] terraform1.14.3:       + tags_all               = {}
08:31:48.943 STDOUT [env/dev/load-balancer] terraform1.14.3:       + to_port                = 80
08:31:48.943 STDOUT [env/dev/load-balancer] terraform1.14.3:     }
08:31:48.943 STDOUT [env/dev/load-balancer] terraform1.14.3:   # aws_vpc_security_group_ingress_rule.alb_https will be created
08:31:48.943 STDOUT [env/dev/load-balancer] terraform1.14.3:   + resource "aws_vpc_security_group_ingress_rule" "alb_https" {
08:31:48.943 STDOUT [env/dev/load-balancer] terraform1.14.3:       + arn                    = (known after apply)
08:31:48.943 STDOUT [env/dev/load-balancer] terraform1.14.3:       + cidr_ipv4              = "0.0.0.0/0"
08:31:48.943 STDOUT [env/dev/load-balancer] terraform1.14.3:       + from_port              = 443
08:31:48.943 STDOUT [env/dev/load-balancer] terraform1.14.3:       + id                     = (known after apply)
08:31:48.943 STDOUT [env/dev/load-balancer] terraform1.14.3:       + ip_protocol            = "tcp"
08:31:48.944 STDOUT [env/dev/load-balancer] terraform1.14.3:       + region                 = "us-east-1"
08:31:48.944 STDOUT [env/dev/load-balancer] terraform1.14.3:       + security_group_id      = (known after apply)
08:31:48.944 STDOUT [env/dev/load-balancer] terraform1.14.3:       + security_group_rule_id = (known after apply)
08:31:48.944 STDOUT [env/dev/load-balancer] terraform1.14.3:       + tags_all               = {}
08:31:48.944 STDOUT [env/dev/load-balancer] terraform1.14.3:       + to_port                = 443
08:31:48.944 STDOUT [env/dev/load-balancer] terraform1.14.3:     }
08:31:48.944 STDOUT [env/dev/load-balancer] terraform1.14.3: Plan: 7 to add, 0 to change, 0 to destroy.
08:31:48.944 STDOUT [env/dev/load-balancer] terraform1.14.3: Changes to Outputs:
08:31:48.944 STDOUT [env/dev/load-balancer] terraform1.14.3:   + aws_alb_target_group_arn  = (known after apply)
08:31:48.944 STDOUT [env/dev/load-balancer] terraform1.14.3:   + aws_security_group_alb_id = (known after apply)
08:31:49.518 STDOUT [env/dev/load-balancer] terraform1.14.3: aws_security_group.alb_sg: Creating...
08:31:49.519 STDOUT [env/dev/load-balancer] terraform1.14.3: aws_lb_target_group.tg: Creating...
08:31:50.170 STDOUT [env/dev/load-balancer] terraform1.14.3: aws_lb_target_group.tg: Creation complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:730335384723:targetgroup/dev-tg/f42b3c24b4770413]
08:31:51.263 STDOUT [env/dev/load-balancer] terraform1.14.3: aws_security_group.alb_sg: Creation complete after 1s [id=sg-02a48cf9703e2d2f9]
08:31:51.287 STDOUT [env/dev/load-balancer] terraform1.14.3: aws_lb.lb: Creating...
08:31:51.296 STDOUT [env/dev/load-balancer] terraform1.14.3: aws_vpc_security_group_ingress_rule.alb_http: Creating...
08:31:51.297 STDOUT [env/dev/load-balancer] terraform1.14.3: aws_vpc_security_group_egress_rule.alb_all_out: Creating...
08:31:51.299 STDOUT [env/dev/load-balancer] terraform1.14.3: aws_vpc_security_group_ingress_rule.alb_https: Creating...
08:31:51.542 STDOUT [env/dev/load-balancer] terraform1.14.3: aws_vpc_security_group_ingress_rule.alb_http: Creation complete after 1s [id=sgr-0c3d635ecc89a979f]
08:31:51.569 STDOUT [env/dev/load-balancer] terraform1.14.3: aws_vpc_security_group_egress_rule.alb_all_out: Creation complete after 1s [id=sgr-0260fce6067bade8f]
08:31:51.619 STDOUT [env/dev/load-balancer] terraform1.14.3: aws_vpc_security_group_ingress_rule.alb_https: Creation complete after 1s [id=sgr-08435ce6d8b6d7074]
08:32:01.287 STDOUT [env/dev/load-balancer] terraform1.14.3: aws_lb.lb: Still creating... [00m10s elapsed]
08:32:11.287 STDOUT [env/dev/load-balancer] terraform1.14.3: aws_lb.lb: Still creating... [00m20s elapsed]
08:32:21.287 STDOUT [env/dev/load-balancer] terraform1.14.3: aws_lb.lb: Still creating... [00m30s elapsed]
08:32:31.288 STDOUT [env/dev/load-balancer] terraform1.14.3: aws_lb.lb: Still creating... [00m40s elapsed]
08:32:41.288 STDOUT [env/dev/load-balancer] terraform1.14.3: aws_lb.lb: Still creating... [00m50s elapsed]
08:32:51.288 STDOUT [env/dev/load-balancer] terraform1.14.3: aws_lb.lb: Still creating... [01m00s elapsed]
08:33:01.288 STDOUT [env/dev/load-balancer] terraform1.14.3: aws_lb.lb: Still creating... [01m10s elapsed]
08:33:11.288 STDOUT [env/dev/load-balancer] terraform1.14.3: aws_lb.lb: Still creating... [01m20s elapsed]
08:33:21.289 STDOUT [env/dev/load-balancer] terraform1.14.3: aws_lb.lb: Still creating... [01m30s elapsed]
08:33:31.289 STDOUT [env/dev/load-balancer] terraform1.14.3: aws_lb.lb: Still creating... [01m40s elapsed]
08:33:41.289 STDOUT [env/dev/load-balancer] terraform1.14.3: aws_lb.lb: Still creating... [01m50s elapsed]
08:33:51.289 STDOUT [env/dev/load-balancer] terraform1.14.3: aws_lb.lb: Still creating... [02m00s elapsed]
08:34:01.289 STDOUT [env/dev/load-balancer] terraform1.14.3: aws_lb.lb: Still creating... [02m10s elapsed]
08:34:11.290 STDOUT [env/dev/load-balancer] terraform1.14.3: aws_lb.lb: Still creating... [02m20s elapsed]
08:34:12.681 STDOUT [env/dev/load-balancer] terraform1.14.3: aws_lb.lb: Creation complete after 2m22s [id=arn:aws:elasticloadbalancing:us-east-1:730335384723:loadbalancer/app/dev-alb/6950ba84277af308]
08:34:12.789 STDOUT [env/dev/load-balancer] terraform1.14.3: aws_lb_listener.lb_listener: Creating...
08:34:12.980 STDOUT [env/dev/load-balancer] terraform1.14.3: aws_lb_listener.lb_listener: Creation complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:730335384723:listener/app/dev-alb/6950ba84277af308/8cf94c35f148d046]
08:34:13.017 STDOUT [env/dev/load-balancer] terraform1.14.3: Apply complete! Resources: 7 added, 0 changed, 0 destroyed.
08:34:13.017 STDOUT [env/dev/load-balancer] terraform1.14.3: Outputs:
08:34:13.017 STDOUT [env/dev/load-balancer] terraform1.14.3: aws_alb_target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:730335384723:targetgroup/dev-tg/f42b3c24b4770413"
08:34:13.017 STDOUT [env/dev/load-balancer] terraform1.14.3: aws_security_group_alb_id = "sg-02a48cf9703e2d2f9"
08:34:15.731 INFO   [env/dev/ec2] Downloading Terraform configurations from ./modules/ec2 into ./env/dev/ec2/.terragrunt-cache/7Yix-_L48VetEy4HktEmdGECImk/hwS2t4bDmp4dtSyIiKag-a0gvxI
08:34:15.765 INFO   [env/dev/ec2] terraform1.14.3: Initializing the backend...
08:34:15.850 INFO   [env/dev/ec2] terraform1.14.3: Successfully configured the backend "s3"! Terraform will automatically
08:34:15.850 INFO   [env/dev/ec2] terraform1.14.3: use this backend unless the backend configuration changes.
08:34:15.902 INFO   [env/dev/ec2] terraform1.14.3: Initializing provider plugins...
08:34:15.902 INFO   [env/dev/ec2] terraform1.14.3: - Reusing previous version of hashicorp/aws from the dependency lock file
08:34:15.984 INFO   [env/dev/ec2] terraform1.14.3: - Installing hashicorp/aws v6.36.0...
08:34:30.116 INFO   [env/dev/ec2] terraform1.14.3: - Installed hashicorp/aws v6.36.0 (signed by HashiCorp)
08:34:30.116 INFO   [env/dev/ec2] terraform1.14.3: Terraform has made some changes to the provider dependency selections recorded
08:34:30.116 INFO   [env/dev/ec2] terraform1.14.3: in the .terraform.lock.hcl file. Review those changes and commit them to your
08:34:30.116 INFO   [env/dev/ec2] terraform1.14.3: version control system if they represent changes you intended to make.
08:34:30.116 INFO   [env/dev/ec2] terraform1.14.3: Terraform has been successfully initialized!
08:34:36.270 STDOUT [env/dev/ec2] terraform1.14.3: Terraform used the selected providers to generate the following execution
08:34:36.270 STDOUT [env/dev/ec2] terraform1.14.3: plan. Resource actions are indicated with the following symbols:
08:34:36.270 STDOUT [env/dev/ec2] terraform1.14.3:   + create
08:34:36.270 STDOUT [env/dev/ec2] terraform1.14.3: Terraform will perform the following actions:
08:34:36.270 STDOUT [env/dev/ec2] terraform1.14.3:   # aws_autoscaling_group.main will be created
08:34:36.270 STDOUT [env/dev/ec2] terraform1.14.3:   + resource "aws_autoscaling_group" "main" {
08:34:36.270 STDOUT [env/dev/ec2] terraform1.14.3:       + arn                              = (known after apply)
08:34:36.271 STDOUT [env/dev/ec2] terraform1.14.3:       + availability_zones               = (known after apply)
08:34:36.271 STDOUT [env/dev/ec2] terraform1.14.3:       + default_cooldown                 = (known after apply)
08:34:36.271 STDOUT [env/dev/ec2] terraform1.14.3:       + desired_capacity                 = 1
08:34:36.271 STDOUT [env/dev/ec2] terraform1.14.3:       + force_delete                     = false
08:34:36.271 STDOUT [env/dev/ec2] terraform1.14.3:       + force_delete_warm_pool           = false
08:34:36.271 STDOUT [env/dev/ec2] terraform1.14.3:       + health_check_grace_period        = 300
08:34:36.271 STDOUT [env/dev/ec2] terraform1.14.3:       + health_check_type                = "ELB"
08:34:36.271 STDOUT [env/dev/ec2] terraform1.14.3:       + id                               = (known after apply)
08:34:36.271 STDOUT [env/dev/ec2] terraform1.14.3:       + ignore_failed_scaling_activities = false
08:34:36.271 STDOUT [env/dev/ec2] terraform1.14.3:       + load_balancers                   = (known after apply)
08:34:36.271 STDOUT [env/dev/ec2] terraform1.14.3:       + max_size                         = 1
08:34:36.271 STDOUT [env/dev/ec2] terraform1.14.3:       + metrics_granularity              = "1Minute"
08:34:36.271 STDOUT [env/dev/ec2] terraform1.14.3:       + min_size                         = 0
08:34:36.271 STDOUT [env/dev/ec2] terraform1.14.3:       + name                             = "dev-asg"
08:34:36.271 STDOUT [env/dev/ec2] terraform1.14.3:       + name_prefix                      = (known after apply)
08:34:36.271 STDOUT [env/dev/ec2] terraform1.14.3:       + predicted_capacity               = (known after apply)
08:34:36.271 STDOUT [env/dev/ec2] terraform1.14.3:       + protect_from_scale_in            = false
08:34:36.272 STDOUT [env/dev/ec2] terraform1.14.3:       + region                           = "us-east-1"
08:34:36.272 STDOUT [env/dev/ec2] terraform1.14.3:       + service_linked_role_arn          = (known after apply)
08:34:36.272 STDOUT [env/dev/ec2] terraform1.14.3:       + target_group_arns                = [
08:34:36.272 STDOUT [env/dev/ec2] terraform1.14.3:           + "arn:aws:elasticloadbalancing:us-east-1:730335384723:targetgroup/dev-tg/f42b3c24b4770413",
08:34:36.272 STDOUT [env/dev/ec2] terraform1.14.3:         ]
08:34:36.272 STDOUT [env/dev/ec2] terraform1.14.3:       + vpc_zone_identifier              = [
08:34:36.272 STDOUT [env/dev/ec2] terraform1.14.3:           + "subnet-0020652c3d4869215",
08:34:36.272 STDOUT [env/dev/ec2] terraform1.14.3:           + "subnet-05d10582d81d7a1ea",
08:34:36.272 STDOUT [env/dev/ec2] terraform1.14.3:           + "subnet-07841a8f6b8c6335b",
08:34:36.272 STDOUT [env/dev/ec2] terraform1.14.3:         ]
08:34:36.272 STDOUT [env/dev/ec2] terraform1.14.3:       + wait_for_capacity_timeout        = "10m"
08:34:36.272 STDOUT [env/dev/ec2] terraform1.14.3:       + warm_pool_size                   = (known after apply)
08:34:36.272 STDOUT [env/dev/ec2] terraform1.14.3:       + availability_zone_distribution (known after apply)
08:34:36.272 STDOUT [env/dev/ec2] terraform1.14.3:       + capacity_reservation_specification (known after apply)
08:34:36.272 STDOUT [env/dev/ec2] terraform1.14.3:       + instance_refresh {
08:34:36.272 STDOUT [env/dev/ec2] terraform1.14.3:           + strategy = "Rolling"
08:34:36.272 STDOUT [env/dev/ec2] terraform1.14.3:           + triggers = [
08:34:36.272 STDOUT [env/dev/ec2] terraform1.14.3:               + "launch_template",
08:34:36.272 STDOUT [env/dev/ec2] terraform1.14.3:             ]
08:34:36.272 STDOUT [env/dev/ec2] terraform1.14.3:           + preferences {
08:34:36.272 STDOUT [env/dev/ec2] terraform1.14.3:               + instance_warmup              = "300"
08:34:36.273 STDOUT [env/dev/ec2] terraform1.14.3:               + max_healthy_percentage       = 100
08:34:36.273 STDOUT [env/dev/ec2] terraform1.14.3:               + min_healthy_percentage       = 0
08:34:36.273 STDOUT [env/dev/ec2] terraform1.14.3:               + scale_in_protected_instances = "Ignore"
08:34:36.273 STDOUT [env/dev/ec2] terraform1.14.3:               + skip_matching                = false
08:34:36.273 STDOUT [env/dev/ec2] terraform1.14.3:               + standby_instances            = "Ignore"
08:34:36.273 STDOUT [env/dev/ec2] terraform1.14.3:             }
08:34:36.273 STDOUT [env/dev/ec2] terraform1.14.3:         }
08:34:36.273 STDOUT [env/dev/ec2] terraform1.14.3:       + launch_template {
08:34:36.273 STDOUT [env/dev/ec2] terraform1.14.3:           + id      = (known after apply)
08:34:36.273 STDOUT [env/dev/ec2] terraform1.14.3:           + name    = (known after apply)
08:34:36.273 STDOUT [env/dev/ec2] terraform1.14.3:           + version = "$Latest"
08:34:36.273 STDOUT [env/dev/ec2] terraform1.14.3:         }
08:34:36.273 STDOUT [env/dev/ec2] terraform1.14.3:       + mixed_instances_policy (known after apply)
08:34:36.273 STDOUT [env/dev/ec2] terraform1.14.3:       + tag {
08:34:36.273 STDOUT [env/dev/ec2] terraform1.14.3:           + key                 = "env"
08:34:36.273 STDOUT [env/dev/ec2] terraform1.14.3:           + propagate_at_launch = true
08:34:36.273 STDOUT [env/dev/ec2] terraform1.14.3:           + value               = "dev"
08:34:36.273 STDOUT [env/dev/ec2] terraform1.14.3:         }
08:34:36.273 STDOUT [env/dev/ec2] terraform1.14.3:       + traffic_source (known after apply)
08:34:36.273 STDOUT [env/dev/ec2] terraform1.14.3:     }
08:34:36.273 STDOUT [env/dev/ec2] terraform1.14.3:   # aws_iam_instance_profile.ec2_ssm_profile will be created
08:34:36.273 STDOUT [env/dev/ec2] terraform1.14.3:   + resource "aws_iam_instance_profile" "ec2_ssm_profile" {
08:34:36.273 STDOUT [env/dev/ec2] terraform1.14.3:       + arn         = (known after apply)
08:34:36.274 STDOUT [env/dev/ec2] terraform1.14.3:       + create_date = (known after apply)
08:34:36.274 STDOUT [env/dev/ec2] terraform1.14.3:       + id          = (known after apply)
08:34:36.274 STDOUT [env/dev/ec2] terraform1.14.3:       + name        = (known after apply)
08:34:36.274 STDOUT [env/dev/ec2] terraform1.14.3:       + name_prefix = (known after apply)
08:34:36.274 STDOUT [env/dev/ec2] terraform1.14.3:       + path        = "/"
08:34:36.274 STDOUT [env/dev/ec2] terraform1.14.3:       + role        = "ssm-role"
08:34:36.274 STDOUT [env/dev/ec2] terraform1.14.3:       + tags_all    = (known after apply)
08:34:36.274 STDOUT [env/dev/ec2] terraform1.14.3:       + unique_id   = (known after apply)
08:34:36.274 STDOUT [env/dev/ec2] terraform1.14.3:     }
08:34:36.274 STDOUT [env/dev/ec2] terraform1.14.3:   # aws_iam_role.ec2_ssm_role will be created
08:34:36.274 STDOUT [env/dev/ec2] terraform1.14.3:   + resource "aws_iam_role" "ec2_ssm_role" {
08:34:36.274 STDOUT [env/dev/ec2] terraform1.14.3:       + arn                   = (known after apply)
08:34:36.274 STDOUT [env/dev/ec2] terraform1.14.3:       + assume_role_policy    = jsonencode(
08:34:36.274 STDOUT [env/dev/ec2] terraform1.14.3:             {
08:34:36.274 STDOUT [env/dev/ec2] terraform1.14.3:               + Statement = [
08:34:36.274 STDOUT [env/dev/ec2] terraform1.14.3:                   + {
08:34:36.274 STDOUT [env/dev/ec2] terraform1.14.3:                       + Action    = "sts:AssumeRole"
08:34:36.274 STDOUT [env/dev/ec2] terraform1.14.3:                       + Effect    = "Allow"
08:34:36.275 STDOUT [env/dev/ec2] terraform1.14.3:                       + Principal = {
08:34:36.275 STDOUT [env/dev/ec2] terraform1.14.3:                           + Service = "ec2.amazonaws.com"
08:34:36.275 STDOUT [env/dev/ec2] terraform1.14.3:                         }
08:34:36.275 STDOUT [env/dev/ec2] terraform1.14.3:                       + Sid       = ""
08:34:36.275 STDOUT [env/dev/ec2] terraform1.14.3:                     },
08:34:36.276 STDOUT [env/dev/ec2] terraform1.14.3:                 ]
08:34:36.276 STDOUT [env/dev/ec2] terraform1.14.3:               + Version   = "2012-10-17"
08:34:36.276 STDOUT [env/dev/ec2] terraform1.14.3:             }
08:34:36.276 STDOUT [env/dev/ec2] terraform1.14.3:         )
08:34:36.276 STDOUT [env/dev/ec2] terraform1.14.3:       + create_date           = (known after apply)
08:34:36.276 STDOUT [env/dev/ec2] terraform1.14.3:       + force_detach_policies = false
08:34:36.276 STDOUT [env/dev/ec2] terraform1.14.3:       + id                    = (known after apply)
08:34:36.276 STDOUT [env/dev/ec2] terraform1.14.3:       + managed_policy_arns   = (known after apply)
08:34:36.276 STDOUT [env/dev/ec2] terraform1.14.3:       + max_session_duration  = 3600
08:34:36.276 STDOUT [env/dev/ec2] terraform1.14.3:       + name                  = "ssm-role"
08:34:36.276 STDOUT [env/dev/ec2] terraform1.14.3:       + name_prefix           = (known after apply)
08:34:36.277 STDOUT [env/dev/ec2] terraform1.14.3:       + path                  = "/"
08:34:36.277 STDOUT [env/dev/ec2] terraform1.14.3:       + tags_all              = (known after apply)
08:34:36.277 STDOUT [env/dev/ec2] terraform1.14.3:       + unique_id             = (known after apply)
08:34:36.277 STDOUT [env/dev/ec2] terraform1.14.3:       + inline_policy (known after apply)
08:34:36.277 STDOUT [env/dev/ec2] terraform1.14.3:     }
08:34:36.277 STDOUT [env/dev/ec2] terraform1.14.3:   # aws_iam_role_policy_attachment.ssm_attachment will be created
08:34:36.277 STDOUT [env/dev/ec2] terraform1.14.3:   + resource "aws_iam_role_policy_attachment" "ssm_attachment" {
08:34:36.277 STDOUT [env/dev/ec2] terraform1.14.3:       + id         = (known after apply)
08:34:36.277 STDOUT [env/dev/ec2] terraform1.14.3:       + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
08:34:36.278 STDOUT [env/dev/ec2] terraform1.14.3:       + role       = "ssm-role"
08:34:36.278 STDOUT [env/dev/ec2] terraform1.14.3:     }
08:34:36.278 STDOUT [env/dev/ec2] terraform1.14.3:   # aws_launch_template.main will be created
08:34:36.278 STDOUT [env/dev/ec2] terraform1.14.3:   + resource "aws_launch_template" "main" {
08:34:36.278 STDOUT [env/dev/ec2] terraform1.14.3:       + arn                    = (known after apply)
08:34:36.278 STDOUT [env/dev/ec2] terraform1.14.3:       + default_version        = (known after apply)
08:34:36.278 STDOUT [env/dev/ec2] terraform1.14.3:       + id                     = (known after apply)
08:34:36.279 STDOUT [env/dev/ec2] terraform1.14.3:       + image_id               = "ami-02777684819ca2214"
08:34:36.279 STDOUT [env/dev/ec2] terraform1.14.3:       + instance_type          = "t3.micro"
08:34:36.279 STDOUT [env/dev/ec2] terraform1.14.3:       + latest_version         = (known after apply)
08:34:36.279 STDOUT [env/dev/ec2] terraform1.14.3:       + name                   = (known after apply)
08:34:36.279 STDOUT [env/dev/ec2] terraform1.14.3:       + name_prefix            = "dev-ec2-"
08:34:36.279 STDOUT [env/dev/ec2] terraform1.14.3:       + region                 = "us-east-1"
08:34:36.280 STDOUT [env/dev/ec2] terraform1.14.3:       + tags_all               = (known after apply)
08:34:36.280 STDOUT [env/dev/ec2] terraform1.14.3:       + user_data              = "IyEvYmluL2Jhc2gKc2V0IC1ldXhvIHBpcGVmYWlsCgpBUFBfRElSPSIvb3B0L3N0cmFwaS1hcHAiClBHX0RCPSJzdHJhcGlkYiIKUEdfVVNFUj0ic3RyYXBpdXNlciIKUEdfUEFTUz0iQ2hhbmdlTWVfU3Ryb25nUGFzc3dvcmQiClBHX1BPUlQ9IjU0MzIiCgpjYXQgPi9vcHQvaGVhbHRoei5weSA8PCdFT0YnCmZyb20gaHR0cC5zZXJ2ZXIgaW1wb3J0IEJhc2VIVFRQUmVxdWVzdEhhbmRsZXIsIEhUVFBTZXJ2ZXIKCmNsYXNzIEgoQmFzZUhUVFBSZXF1ZXN0SGFuZGxlcik6CiAgICBkZWYgZG9fR0VUKHNlbGYpOgogICAgICAgIGlmIHNlbGYucGF0aCBpbiAoIi8iLCAiL2hlYWx0aCIsICIvaGVhbHRoeiIpOgogICAgICAgICAgICBzZWxmLnNlbmRfcmVzcG9uc2UoMjAwKQogICAgICAgICAgICBzZWxmLmVuZF9oZWFkZXJzKCkKICAgICAgICAgICAgc2VsZi53ZmlsZS53cml0ZShiIk9LIikKICAgICAgICBlbHNlOgogICAgICAgICAgICBzZWxmLnNlbmRfcmVzcG9uc2UoNDA0KQogICAgICAgICAgICBzZWxmLmVuZF9oZWFkZXJzKCkKCkhUVFBTZXJ2ZXIoKCIwLjAuMC4wIiwgODApLCBIKS5zZXJ2ZV9mb3JldmVyKCkKRU9GCgpub2h1cCBweXRob24zIC9vcHQvaGVhbHRoei5weSA+L3Zhci9sb2cvaGVhbHRoei5sb2cgMj4mMSAmCgpsb2coKSB7IGVjaG8gIlt1c2VyLWRhdGFdICQqIjsgfQoKZG5mIC15IHVwZGF0ZSB8fCB5dW0gLXkgdXBkYXRlCmRuZiAteSBpbnN0YWxsIGdpdCBnY2MtYysrIG1ha2Ugbm9kZWpzIHx8IHl1bSAteSBpbnN0YWxsIGdpdCBnY2MtYysrIG1ha2Ugbm9kZWpzCgojIEluc3RhbGwgcG0yCm5wbSBpIC1nIHBtMgoKIyBBcHAgdXNlcgppZCAtdSBzdHJhcGkgPi9kZXYvbnVsbCAyPiYxIHx8IHVzZXJhZGQgLW0gLXMgL2Jpbi9iYXNoIHN0cmFwaQoKI2luc3RhbGwgcG9zdGdyZXMKCmRuZiAteSBpbnN0YWxsIHBvc3RncmVzcWwxNi1zZXJ2ZXIgfHwgdHJ1ZQppZiBjb21tYW5kIC12IHBvc3RncmVzcWwtc2V0dXAgPi9kZXYvbnVsbCAyPiYxOyB0aGVuCiAgIyBBTDIgLyBzb21lIGJ1aWxkcwogIHBvc3RncmVzcWwtc2V0dXAgLS1pbml0ZGIgfHwgdHJ1ZQplbGlmIFsgLXggL3Vzci9iaW4vcG9zdGdyZXNxbC1zZXR1cCBdOyB0aGVuCiAgL3Vzci9iaW4vcG9zdGdyZXNxbC1zZXR1cCAtLWluaXRkYiB8fCB0cnVlCmZpCgpzeXN0ZW1jdGwgZW5hYmxlIHBvc3RncmVzcWwgfHwgc3lzdGVtY3RsIGVuYWJsZSBwb3N0Z3Jlc3FsLTE2IHx8IHRydWUKc3lzdGVtY3RsIHJlc3RhcnQgcG9zdGdyZXNxbCB8fCBzeXN0ZW1jdGwgcmVzdGFydCBwb3N0Z3Jlc3FsLTE2IHx8IHRydWUKCmlmIGlkIC11IHBvc3RncmVzID4vZGV2L251bGwgMj4mMTsgdGhlbgogICMgQ3JlYXRlIERCIHVzZXIgaWYgbm90IGV4aXN0cwogIHN1ZG8gLXUgcG9zdGdyZXMgcHNxbCAtdGMgIlNFTEVDVCAxIEZST00gcGdfcm9sZXMgV0hFUkUgcm9sbmFtZT0nJHtQR19VU0VSfSciIHwgZ3JlcCAtcSAxIHx8IFwKICAgIHN1ZG8gLXUgcG9zdGdyZXMgcHNxbCAtYyAiQ1JFQVRFIFVTRVIgJHtQR19VU0VSfSBXSVRIIFBBU1NXT1JEICcke1BHX1BBU1N9JzsiCgogICMgQ3JlYXRlIERCIGlmIG5vdCBleGlzdHMKICBzdWRvIC11IHBvc3RncmVzIHBzcWwgLXRjICJTRUxFQ1QgMSBGUk9NIHBnX2RhdGFiYXNlIFdIRVJFIGRhdG5hbWU9JyR7UEdfREJ9JyIgfCBncmVwIC1xIDEgfHwgXAogICAgc3VkbyAtdSBwb3N0Z3JlcyBwc3FsIC1jICJDUkVBVEUgREFUQUJBU0UgJHtQR19EQn0gT1dORVIgJHtQR19VU0VSfTsiCmVsc2UKICBsb2cgIldBUk46IHBvc3RncmVzIE9TIHVzZXIgbm90IGZvdW5kOyBza2lwcGluZyBEQiB1c2VyL2RiIGNyZWF0aW9uLiIKZmkKCgpta2RpciAtcCAiJEFQUF9ESVIiCmNob3duIC1SIHN0cmFwaTpzdHJhcGkgIiRBUFBfRElSIgp0b3VjaCAiJEFQUF9ESVIvaW5kZXguaHRtbCIKCiMgQnVpbGQgJiBzdGFydApzdWRvIC11IHN0cmFwaSBiYXNoIC1sYyAiY2QgJEFQUF9ESVIgJiYgbnBtIGluc3RhbGwgJiYgbnBtIHJ1biBidWlsZCIKc3VkbyAtdSBzdHJhcGkgYmFzaCAtbGMgInBtMiBzdGFydCBucG0gLS1uYW1lIHN0cmFwaSAtLSBzdGFydCIKc3VkbyAtdSBzdHJhcGkgYmFzaCAtbGMgInBtMiBzYXZlIgoKIyBTdGFydCBwbTIgb24gYm9vdApwbTIgc3RhcnR1cCBzeXN0ZW1kIC11IHN0cmFwaSAtLWhwIC9ob21lL3N0cmFwaSB8IGJhc2g="
08:34:36.284 STDOUT [env/dev/ec2] terraform1.14.3:       + vpc_security_group_ids = (known after apply)
08:34:36.284 STDOUT [env/dev/ec2] terraform1.14.3:       + block_device_mappings {
08:34:36.284 STDOUT [env/dev/ec2] terraform1.14.3:           + device_name = "/dev/sdf"
08:34:36.284 STDOUT [env/dev/ec2] terraform1.14.3:           + ebs {
08:34:36.284 STDOUT [env/dev/ec2] terraform1.14.3:               + iops                       = (known after apply)
08:34:36.284 STDOUT [env/dev/ec2] terraform1.14.3:               + throughput                 = (known after apply)
08:34:36.284 STDOUT [env/dev/ec2] terraform1.14.3:               + volume_initialization_rate = (known after apply)
08:34:36.284 STDOUT [env/dev/ec2] terraform1.14.3:               + volume_size                = 20
08:34:36.284 STDOUT [env/dev/ec2] terraform1.14.3:               + volume_type                = (known after apply)
08:34:36.285 STDOUT [env/dev/ec2] terraform1.14.3:             }
08:34:36.285 STDOUT [env/dev/ec2] terraform1.14.3:         }
08:34:36.285 STDOUT [env/dev/ec2] terraform1.14.3:       + iam_instance_profile {
08:34:36.285 STDOUT [env/dev/ec2] terraform1.14.3:           + arn = (known after apply)
08:34:36.285 STDOUT [env/dev/ec2] terraform1.14.3:         }
08:34:36.285 STDOUT [env/dev/ec2] terraform1.14.3:       + metadata_options (known after apply)
08:34:36.285 STDOUT [env/dev/ec2] terraform1.14.3:     }
08:34:36.285 STDOUT [env/dev/ec2] terraform1.14.3:   # aws_security_group.ec2_sg will be created
08:34:36.285 STDOUT [env/dev/ec2] terraform1.14.3:   + resource "aws_security_group" "ec2_sg" {
08:34:36.285 STDOUT [env/dev/ec2] terraform1.14.3:       + arn                    = (known after apply)
08:34:36.285 STDOUT [env/dev/ec2] terraform1.14.3:       + description            = "dev-EC2-security-group"
08:34:36.286 STDOUT [env/dev/ec2] terraform1.14.3:       + egress                 = (known after apply)
08:34:36.286 STDOUT [env/dev/ec2] terraform1.14.3:       + id                     = (known after apply)
08:34:36.286 STDOUT [env/dev/ec2] terraform1.14.3:       + ingress                = (known after apply)
08:34:36.286 STDOUT [env/dev/ec2] terraform1.14.3:       + name                   = "dev-ec2-sg"
08:34:36.286 STDOUT [env/dev/ec2] terraform1.14.3:       + name_prefix            = (known after apply)
08:34:36.286 STDOUT [env/dev/ec2] terraform1.14.3:       + owner_id               = (known after apply)
08:34:36.286 STDOUT [env/dev/ec2] terraform1.14.3:       + region                 = "us-east-1"
08:34:36.286 STDOUT [env/dev/ec2] terraform1.14.3:       + revoke_rules_on_delete = false
08:34:36.286 STDOUT [env/dev/ec2] terraform1.14.3:       + tags                   = {
08:34:36.287 STDOUT [env/dev/ec2] terraform1.14.3:           + "env" = "dev"
08:34:36.287 STDOUT [env/dev/ec2] terraform1.14.3:         }
08:34:36.287 STDOUT [env/dev/ec2] terraform1.14.3:       + tags_all               = {
08:34:36.287 STDOUT [env/dev/ec2] terraform1.14.3:           + "env" = "dev"
08:34:36.287 STDOUT [env/dev/ec2] terraform1.14.3:         }
08:34:36.287 STDOUT [env/dev/ec2] terraform1.14.3:       + vpc_id                 = "vpc-0d00152ece6e94c77"
08:34:36.287 STDOUT [env/dev/ec2] terraform1.14.3:     }
08:34:36.287 STDOUT [env/dev/ec2] terraform1.14.3:   # aws_vpc_security_group_egress_rule.ec2_all_out will be created
08:34:36.287 STDOUT [env/dev/ec2] terraform1.14.3:   + resource "aws_vpc_security_group_egress_rule" "ec2_all_out" {
08:34:36.287 STDOUT [env/dev/ec2] terraform1.14.3:       + arn                    = (known after apply)
08:34:36.287 STDOUT [env/dev/ec2] terraform1.14.3:       + cidr_ipv4              = "0.0.0.0/0"
08:34:36.288 STDOUT [env/dev/ec2] terraform1.14.3:       + id                     = (known after apply)
08:34:36.288 STDOUT [env/dev/ec2] terraform1.14.3:       + ip_protocol            = "-1"
08:34:36.288 STDOUT [env/dev/ec2] terraform1.14.3:       + region                 = "us-east-1"
08:34:36.288 STDOUT [env/dev/ec2] terraform1.14.3:       + security_group_id      = (known after apply)
08:34:36.288 STDOUT [env/dev/ec2] terraform1.14.3:       + security_group_rule_id = (known after apply)
08:34:36.288 STDOUT [env/dev/ec2] terraform1.14.3:       + tags_all               = {}
08:34:36.288 STDOUT [env/dev/ec2] terraform1.14.3:     }
08:34:36.288 STDOUT [env/dev/ec2] terraform1.14.3:   # aws_vpc_security_group_ingress_rule.ec2_http will be created
08:34:36.288 STDOUT [env/dev/ec2] terraform1.14.3:   + resource "aws_vpc_security_group_ingress_rule" "ec2_http" {
08:34:36.288 STDOUT [env/dev/ec2] terraform1.14.3:       + arn                          = (known after apply)
08:34:36.289 STDOUT [env/dev/ec2] terraform1.14.3:       + from_port                    = 80
08:34:36.289 STDOUT [env/dev/ec2] terraform1.14.3:       + id                           = (known after apply)
08:34:36.289 STDOUT [env/dev/ec2] terraform1.14.3:       + ip_protocol                  = "tcp"
08:34:36.289 STDOUT [env/dev/ec2] terraform1.14.3:       + referenced_security_group_id = "sg-02a48cf9703e2d2f9"
08:34:36.289 STDOUT [env/dev/ec2] terraform1.14.3:       + region                       = "us-east-1"
08:34:36.289 STDOUT [env/dev/ec2] terraform1.14.3:       + security_group_id            = (known after apply)
08:34:36.289 STDOUT [env/dev/ec2] terraform1.14.3:       + security_group_rule_id       = (known after apply)
08:34:36.289 STDOUT [env/dev/ec2] terraform1.14.3:       + tags_all                     = {}
08:34:36.289 STDOUT [env/dev/ec2] terraform1.14.3:       + to_port                      = 80
08:34:36.289 STDOUT [env/dev/ec2] terraform1.14.3:     }
08:34:36.289 STDOUT [env/dev/ec2] terraform1.14.3:   # aws_vpc_security_group_ingress_rule.ec2_strapi_http will be created
08:34:36.290 STDOUT [env/dev/ec2] terraform1.14.3:   + resource "aws_vpc_security_group_ingress_rule" "ec2_strapi_http" {
08:34:36.290 STDOUT [env/dev/ec2] terraform1.14.3:       + arn                          = (known after apply)
08:34:36.290 STDOUT [env/dev/ec2] terraform1.14.3:       + from_port                    = 1337
08:34:36.290 STDOUT [env/dev/ec2] terraform1.14.3:       + id                           = (known after apply)
08:34:36.290 STDOUT [env/dev/ec2] terraform1.14.3:       + ip_protocol                  = "tcp"
08:34:36.290 STDOUT [env/dev/ec2] terraform1.14.3:       + referenced_security_group_id = "sg-02a48cf9703e2d2f9"
08:34:36.290 STDOUT [env/dev/ec2] terraform1.14.3:       + region                       = "us-east-1"
08:34:36.290 STDOUT [env/dev/ec2] terraform1.14.3:       + security_group_id            = (known after apply)
08:34:36.290 STDOUT [env/dev/ec2] terraform1.14.3:       + security_group_rule_id       = (known after apply)
08:34:36.290 STDOUT [env/dev/ec2] terraform1.14.3:       + tags_all                     = {}
08:34:36.290 STDOUT [env/dev/ec2] terraform1.14.3:       + to_port                      = 1337
08:34:36.290 STDOUT [env/dev/ec2] terraform1.14.3:     }
08:34:36.290 STDOUT [env/dev/ec2] terraform1.14.3: Plan: 9 to add, 0 to change, 0 to destroy.
08:34:36.832 STDOUT [env/dev/ec2] terraform1.14.3: aws_iam_role.ec2_ssm_role: Creating...
08:34:36.833 STDOUT [env/dev/ec2] terraform1.14.3: aws_security_group.ec2_sg: Creating...
08:34:38.723 STDOUT [env/dev/ec2] terraform1.14.3: aws_security_group.ec2_sg: Creation complete after 2s [id=sg-020d236ba8e69bd12]
08:34:38.764 STDOUT [env/dev/ec2] terraform1.14.3: aws_vpc_security_group_ingress_rule.ec2_strapi_http: Creating...
08:34:38.766 STDOUT [env/dev/ec2] terraform1.14.3: aws_vpc_security_group_egress_rule.ec2_all_out: Creating...
08:34:38.767 STDOUT [env/dev/ec2] terraform1.14.3: aws_vpc_security_group_ingress_rule.ec2_http: Creating...
08:34:39.052 STDOUT [env/dev/ec2] terraform1.14.3: aws_vpc_security_group_egress_rule.ec2_all_out: Creation complete after 0s [id=sgr-039b37b9a0d6fc97e]
08:34:39.106 STDOUT [env/dev/ec2] terraform1.14.3: aws_vpc_security_group_ingress_rule.ec2_strapi_http: Creation complete after 0s [id=sgr-098ca5a91c6fc9a9c]
08:34:39.178 STDOUT [env/dev/ec2] terraform1.14.3: aws_vpc_security_group_ingress_rule.ec2_http: Creation complete after 0s [id=sgr-0904da3039d2bdf34]
08:34:39.239 STDOUT [env/dev/ec2] terraform1.14.3: Warning: 'launch_template' always triggers an instance refresh and can be removed
08:34:39.239 STDOUT [env/dev/ec2] terraform1.14.3:   with aws_autoscaling_group.main,
08:34:39.239 STDOUT [env/dev/ec2] terraform1.14.3:   on ec2.tf line 48, in resource "aws_autoscaling_group" "main":
08:34:39.239 STDOUT [env/dev/ec2] terraform1.14.3:   48:     triggers = ["launch_template"]
08:34:39.239 STDOUT [env/dev/ec2] terraform1.14.3: (and one more similar warning elsewhere)
08:34:39.241 STDERR [env/dev/ec2] terraform1.14.3: Error: creating IAM Role (ssm-role): operation error IAM: CreateRole, https response error StatusCode: 403, RequestID: 59e888dd-f743-4646-aca0-df2221429ee3, api error AccessDenied: User: arn:aws:sts::730335384723:assumed-role/test-terragrunt-role/aws-go-sdk-1773995676717953745 is not authorized to perform: iam:CreateRole on resource: arn:aws:iam::730335384723:role/ssm-role because no identity-based policy allows the iam:CreateRole action
08:34:39.241 STDERR [env/dev/ec2] terraform1.14.3:   with aws_iam_role.ec2_ssm_role,
08:34:39.241 STDERR [env/dev/ec2] terraform1.14.3:   on ec2.tf line 67, in resource "aws_iam_role" "ec2_ssm_role":
08:34:39.241 STDERR [env/dev/ec2] terraform1.14.3:   67: resource "aws_iam_role" "ec2_ssm_role" {
08:34:39.280 ERROR  Run failed: error occurred:

* Failed to execute "terraform1.14.3 apply -no-color -input=false -auto-approve" in ./env/dev/ec2/.terragrunt-cache/7Yix-_L48VetEy4HktEmdGECImk/hwS2t4bDmp4dtSyIiKag-a0gvxI
  
  Error: creating IAM Role (ssm-role): operation error IAM: CreateRole, https response error StatusCode: 403, RequestID: 59e888dd-f743-4646-aca0-df2221429ee3, api error AccessDenied: User: arn:aws:sts::730335384723:assumed-role/test-terragrunt-role/aws-go-sdk-1773995676717953745 is not authorized to perform: iam:CreateRole on resource: arn:aws:iam::730335384723:role/ssm-role because no identity-based policy allows the iam:CreateRole action
  
    with aws_iam_role.ec2_ssm_role,
    on ec2.tf line 67, in resource "aws_iam_role" "ec2_ssm_role":
    67: resource "aws_iam_role" "ec2_ssm_role" {
  
  
  exit status 1


❯❯ Run Summary  3 units  5m
   ────────────────────────────
   Succeeded    2
   Failed       1

08:34:39.281 ERROR  error occurred:

* Failed to execute "terraform1.14.3 apply -no-color -input=false -auto-approve" in ./env/dev/ec2/.terragrunt-cache/7Yix-_L48VetEy4HktEmdGECImk/hwS2t4bDmp4dtSyIiKag-a0gvxI
  
  Error: creating IAM Role (ssm-role): operation error IAM: CreateRole, https response error StatusCode: 403, RequestID: 59e888dd-f743-4646-aca0-df2221429ee3, api error AccessDenied: User: arn:aws:sts::730335384723:assumed-role/test-terragrunt-role/aws-go-sdk-1773995676717953745 is not authorized to perform: iam:CreateRole on resource: arn:aws:iam::730335384723:role/ssm-role because no identity-based policy allows the iam:CreateRole action
  
    with aws_iam_role.ec2_ssm_role,
    on ec2.tf line 67, in resource "aws_iam_role" "ec2_ssm_role":
    67: resource "aws_iam_role" "ec2_ssm_role" {
  
  
  exit status 1



```
</details>